      ******************************************************************
      * Author: Rodrigo Ferreira da Silva
      * Date: 04/06/2023
      * Purpose: aprendizado
      * Tectonics: cobc
      ******************************************************************
      PROGRAM-ID. PROGCOMM.
      DATA DIVISION.
      FILE SECTION.
      WORKING-STORAGE SECTION.
      PROCEDURE DIVISION.

      PERFORM P3

